sobczyk/bsp/csps/lpc32xx/source/lpc32xx_slcnand_driver.c
/***********************************************************************
 * $Id:: lpc32xx_slcnand_driver.c 727 2008-05-08 18:23:58Z wellsk      $
 *
 * Project: LPC32xx SLC NAND controller driver
 *
 * Description:
 *     This file contains driver support for the LPC32xx SLC NAND
 *     controller.
 *
 ***********************************************************************
 * Software that is described herein is for illustrative purposes only
 * which provides customers with programming information regarding the
 * products. This software is supplied "AS IS" without any warranties.
 * NXP Semiconductors assumes no responsibility or liability for the
 * use of the software, conveys no license or title under any patent,
 * copyright, or mask work right to the product. NXP Semiconductors
 * reserves the right to make changes in the software without
 * notification. NXP Semiconductors also make no representation or
 * warranty that such application will be suitable for the specified
 * use without further testing or modification.
 *********************************************************************/

#include "lpc32xx_clkpwr_driver.h"
#include "lpc32xx_dma_driver.h"
#include "lpc32xx_intc_driver.h"
#include "lpc_nandflash_params.h"
#include "lpc32xx_slcnand_driver.h"

/***********************************************************************
 * SLC NAND controller driver package data
***********************************************************************/

/* SLC NAND controller device configuration structure type */
typedef struct
{
  BOOL_32 init;           /* Device initialized flag */
  SLCNAND_REGS_T *regptr; /* Pointer to SLC NAND registers */
  NANDFLASH_PARAM_T *paramptr; /* Pointer to NAND flash parameters */
} SLCNAND_CFG_T;

/* SLC NAND controller driver data */
static SLCNAND_CFG_T slcdat;

/* ECC */
static UNS_32 *ECC;

/* device handle */
static INT_32 dmach;

/* DMA list */
static DMAC_LL_T *dmalist;

/* Pointer to DMA registers */
static DMAC_REGS_T *pdmaregs;

/* completion of DMA */
static BOOL_32 dma_completion;

/* Number of DMA channels */
#define DMA_MAX_CHANNELS 8

/***********************************************************************
 * SDcard controller driver private functions
 **********************************************************************/

/***********************************************************************
 *
 * Function: slcnand_dma_interrupt
 *
 * Purpose: DMA controller interrupt handler
 *
 * Processing:
 *     See function.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: None
 *
 * Notes: None
 *
 **********************************************************************/
void slcnand_dma_interrupt(void)
{
  INT_32 ch;

  pdmaregs = dma_get_base();

  /* Check all pending interrupt statuses */
  ch = 0;
  while (ch < DMA_MAX_CHANNELS)
  {
    /* Check channel interrupt status */
    if ((pdmaregs->int_stat & _BIT(ch)) != 0)
    {
      /* Check channel terminal count interrupt status */
      if ((pdmaregs->int_tc_stat & _BIT(ch)) != 0)
      {
        pdmaregs->int_tc_clear = _BIT(ch);
      }

      /* Check channel error interrupt status */
      if ((pdmaregs->int_err_stat & _BIT(ch)) != 0)
      {
        pdmaregs->int_err_clear = _BIT(ch);
      }
    }
    /* Next channel */
    ch++;
  }
}

/***********************************************************************
 *
 * Function: slcnand_interrupt
 *
 * Purpose: SLC NAND controller interrupt handler
 *
 * Processing:
 *     See function.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: None
 *
 * Notes: None
 *
 **********************************************************************/
void slcnand_interrupt(void)
{
  if (slcdat.regptr->slc_int_stat & SLCSTAT_INT_RDY_EN)
  {
    slcdat.regptr->slc_icr = SLCSTAT_INT_RDY_EN;
  }

  if (slcdat.regptr->slc_int_stat & SLCSTAT_INT_TC)
  {
    slcdat.regptr->slc_icr = SLCSTAT_INT_TC;
    dma_completion = TRUE;
  }
}

/***********************************************************************
 *
 * Function: slcnand_dma_read
 *
 * Purpose: Setup DMA channel for dma read from slc
 *
 * Processing:
 *     Transfer data from slc to memory and save ECC generated
 *     by hardware.
 *
 * Parameters:
 *     devid: Pointer to SLC NAND controller config structure
 *     dmasrc: DMA src address
 *     dmadest: DMA dest address
 *     ecc: ECC ECC enable(TRUE)/disable(FALSE)
 *
 * Outputs: None
 *
 * Returns: The status of DMA channel setup for dma read from slc
 *
 * Notes: None
 *
 **********************************************************************/
STATUS slcnand_dma_read(INT_32 devid, UNS_32 dmasrc, UNS_32 dmadest,
                        DMAC_LL_T *dma, UNS_32 *ecc)
{
  STATUS status = _NO_ERROR;
  INT_32 idx;

  dma_completion = FALSE;

  dmalist = dma;

  ECC = ecc;

  if (slcdat.paramptr->block_page == BLOCK_PAGE_SMALL)
  {
    if (ecc != 0)
    {
      dmalist[0].dma_src = dmasrc;
      dmalist[0].dma_dest = (UNS_32)dmadest;
      dmalist[0].next_lli = (UNS_32) & dmalist[1];
      dmalist[0].next_ctrl = (
                    ((SMALL_BLOCK_PAGE_MAIN_AREA_SIZE / 2) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_DEST_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

      dmalist[1].dma_src = (UNS_32) & slcdat.regptr->slc_ecc;
      dmalist[1].dma_dest = (UNS_32) & ECC[0];
      dmalist[1].next_lli = (UNS_32) & dmalist[2];
      dmalist[1].next_ctrl = (0x1 |
                    DMAC_CHAN_SRC_BURST_1 |
                    DMAC_CHAN_DEST_BURST_1 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_INT_TC_EN);

      dmalist[2].dma_src = dmasrc;
      dmalist[2].dma_dest = (UNS_32)(dmadest +
                    (SMALL_BLOCK_PAGE_MAIN_AREA_SIZE / 2));
      dmalist[2].next_lli = (UNS_32) & dmalist[3];
      dmalist[2].next_ctrl = (
                    ((SMALL_BLOCK_PAGE_MAIN_AREA_SIZE / 2) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_DEST_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

