sobczyk/bsp/csps/lpc32xx/source/lpc32xx_slcnand_driver.c
      dmalist[3].dma_src = (UNS_32) & slcdat.regptr->slc_ecc;
      dmalist[3].dma_dest = (UNS_32) & ECC[1];
      dmalist[3].next_lli = (UNS_32) & dmalist[4];
      dmalist[3].next_ctrl = (0x1 |
                    DMAC_CHAN_SRC_BURST_1 |
                    DMAC_CHAN_DEST_BURST_1 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_INT_TC_EN);

      dmalist[4].dma_src = dmasrc;
      dmalist[4].dma_dest = (UNS_32)(dmadest +
                    SMALL_BLOCK_PAGE_MAIN_AREA_SIZE);
      dmalist[4].next_lli = 0;
      dmalist[4].next_ctrl = (
                    (SMALL_BLOCK_PAGE_SPARE_AREA_SIZE / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_DEST_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);
    }
    else
    {
      dmalist[0].dma_src = dmasrc;
      dmalist[0].dma_dest = (UNS_32)dmadest;
      dmalist[0].next_lli = (UNS_32) & dmalist[1];
      dmalist[0].next_ctrl = (
                    ((SMALL_BLOCK_PAGE_MAIN_AREA_SIZE / 2) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_DEST_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

      dmalist[1].dma_src = dmasrc;
      dmalist[1].dma_dest = (UNS_32)(dmadest +
                    (SMALL_BLOCK_PAGE_MAIN_AREA_SIZE / 2));
      dmalist[1].next_lli = (UNS_32) & dmalist[2];
      dmalist[1].next_ctrl = (
                    ((SMALL_BLOCK_PAGE_MAIN_AREA_SIZE / 2) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_DEST_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

      dmalist[2].dma_src = dmasrc;
      dmalist[2].dma_dest = (UNS_32)(dmadest +
                    SMALL_BLOCK_PAGE_MAIN_AREA_SIZE);
      dmalist[2].next_lli = 0;
      dmalist[2].next_ctrl = (
                    (SMALL_BLOCK_PAGE_SPARE_AREA_SIZE / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_DEST_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);
    }
  }
  else if (slcdat.paramptr->block_page == BLOCK_PAGE_LARGE)
  {
    if (ecc != 0)
    {
      for (idx = 0; idx < 4; idx++)
      {
        dmalist[idx*4].dma_src = dmasrc;
        dmalist[idx*4].dma_dest = (UNS_32)(dmadest +
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) * (idx * 2)));
        dmalist[idx*4].next_lli = (UNS_32) & dmalist[(idx*4)+1];
        dmalist[idx*4].next_ctrl = (
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_DEST_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

        dmalist[(idx*4)+1].dma_src = (UNS_32)
                    & slcdat.regptr->slc_ecc;
        dmalist[(idx*4)+1].dma_dest = (UNS_32) & ECC[idx*2];
        dmalist[(idx*4)+1].next_lli =
                    (UNS_32) & dmalist[(idx*4)+2];
        dmalist[(idx*4)+1].next_ctrl = (0x1 |
                    DMAC_CHAN_SRC_BURST_1 |
                    DMAC_CHAN_DEST_BURST_1 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_INT_TC_EN);

        dmalist[(idx*4)+2].dma_src = dmasrc;
        dmalist[(idx*4)+2].dma_dest = (UNS_32)(dmadest +
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) *
                    ((idx * 2) + 1)));
        dmalist[(idx*4)+2].next_lli =
                    (UNS_32) & dmalist[(idx*4)+3];
        dmalist[(idx*4)+2].next_ctrl = (
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_DEST_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

        dmalist[(idx*4)+3].dma_src = (UNS_32)
                    & slcdat.regptr->slc_ecc;
        dmalist[(idx*4)+3].dma_dest = (UNS_32) & ECC[(idx*2)+1];
        dmalist[(idx*4)+3].next_lli =
                    (UNS_32) & dmalist[(idx*4)+4];
        dmalist[(idx*4)+3].next_ctrl = (0x1 |
                    DMAC_CHAN_SRC_BURST_1 |
                    DMAC_CHAN_DEST_BURST_1 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_INT_TC_EN);
      }
      dmalist[idx*4].dma_src = dmasrc;
      dmalist[idx*4].dma_dest = (UNS_32)(dmadest +
                    LARGE_BLOCK_PAGE_MAIN_AREA_SIZE);
      dmalist[idx*4].next_lli = 0;
      dmalist[idx*4].next_ctrl = (
                    (LARGE_BLOCK_PAGE_SPARE_AREA_SIZE / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_DEST_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);
    }
    else
    {
      for (idx = 0; idx < 4; idx++)
      {
        dmalist[idx*2].dma_src = dmasrc;
        dmalist[idx*2].dma_dest = (UNS_32)(dmadest +
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) * (idx * 2)));
        dmalist[idx*2].next_lli = (UNS_32) & dmalist[(idx*2)+1];
        dmalist[idx*2].next_ctrl = (
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_DEST_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

        dmalist[(idx*2)+1].dma_src = dmasrc;
        dmalist[(idx*2)+1].dma_dest = (UNS_32)(dmadest +
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) *
                    ((idx * 2) + 1)));
        dmalist[(idx*2)+1].next_lli =
                    (UNS_32) & dmalist[(idx*2)+2];
        dmalist[(idx*2)+1].next_ctrl = (
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_DEST_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);
      }
      dmalist[idx*2].dma_src = dmasrc;
      dmalist[idx*2].dma_dest = (UNS_32)(dmadest +
                    LARGE_BLOCK_PAGE_MAIN_AREA_SIZE);
      dmalist[idx*2].next_lli = 0;
      dmalist[idx*2].next_ctrl = (
                    (LARGE_BLOCK_PAGE_SPARE_AREA_SIZE / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_DEST_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);
    }
  }

