sobczyk/bsp/csps/lpc32xx/source/lpc32xx_slcnand_driver.c
  /* Get a DMA channel */
  dmach = dma_alloc_channel(-1, (PFV) slcnand_dma_interrupt);
  if (dmach < 0)
  {
    return _ERROR;
  }

  /* setup DMA channel */
  pdmaregs = dma_get_base();
  pdmaregs->int_tc_clear = _BIT(dmach);
  pdmaregs->int_err_clear = _BIT(dmach);
  pdmaregs->dma_chan[dmach].src_addr = dmalist[0].dma_src;
  pdmaregs->dma_chan[dmach].dest_addr = dmalist[0].dma_dest;
  pdmaregs->dma_chan[dmach].lli = (UNS_32)dmalist[0].next_lli;
  pdmaregs->dma_chan[dmach].control = dmalist[0].next_ctrl;
  pdmaregs->dma_chan[dmach].config_ch = DMAC_CHAN_ITC |
                    DMAC_CHAN_IE |
                    DMAC_CHAN_FLOW_D_P2M |
                    DMAC_DEST_PERIP(0) |
                    DMAC_SRC_PERIP(DMA_PERID_NAND1) |
                    DMAC_CHAN_ENABLE;

  return status;
}

/***********************************************************************
 *
 * Function: slcnand_dma_write
 *
 * Purpose: Setup DMA channel for dma write to slc
 *
 * Processing:
 *     Transfer data from memory to slc and transfer ECC generated
 *     by hardware to memory.
 *
 * Parameters:
 *     devid: Pointer to SLC NAND controller config structure
 *     dmasrc: DMA src address
 *     dmadest: DMA dest address
 *     ecc: ECC ECC enable(TRUE)/disable(FALSE)
 *
 * Outputs: None
 *
 * Returns: The status of DMA channel setup for dma write to slc
 *
 * Notes: None
 *
 **********************************************************************/
STATUS slcnand_dma_write(INT_32 devid, UNS_32 dmasrc, UNS_32 dmadest,
                         DMAC_LL_T *dma, UNS_32 *ecc)
{
  STATUS status = _NO_ERROR;
  INT_32 idx;

  dma_completion = FALSE;

  dmalist = dma;

  if (slcdat.paramptr->block_page == BLOCK_PAGE_SMALL)
  {
    if (ecc != 0)
    {
      dmalist[0].dma_src = (UNS_32)dmasrc;
      dmalist[0].dma_dest = dmadest;
      dmalist[0].next_lli = (UNS_32) & dmalist[1];
      dmalist[0].next_ctrl = (
                    ((SMALL_BLOCK_PAGE_MAIN_AREA_SIZE / 2) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_SRC_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

      dmalist[1].dma_src = (UNS_32)(dmasrc +
                    (SMALL_BLOCK_PAGE_MAIN_AREA_SIZE / 2));
      dmalist[1].dma_dest = dmadest;
      dmalist[1].next_lli = (UNS_32) & dmalist[2];
      dmalist[1].next_ctrl = (
                    ((SMALL_BLOCK_PAGE_MAIN_AREA_SIZE / 2) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_SRC_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

      dmalist[2].dma_src = (UNS_32) & slcdat.regptr->slc_ecc;
      dmalist[2].dma_dest = (UNS_32)(dmasrc +
                    SMALL_BLOCK_PAGE_1ST_ECC);
      dmalist[2].next_lli = (UNS_32) & dmalist[3];
      dmalist[2].next_ctrl = (0x1 |
                    DMAC_CHAN_SRC_BURST_1 |
                    DMAC_CHAN_DEST_BURST_1 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_INT_TC_EN);

      dmalist[3].dma_src = (UNS_32) & slcdat.regptr->slc_ecc;
      dmalist[3].dma_dest = (UNS_32)(dmasrc +
                    SMALL_BLOCK_PAGE_2ND_ECC);
      dmalist[3].next_lli = (UNS_32) & dmalist[4];
      dmalist[3].next_ctrl = (0x1 |
                    DMAC_CHAN_SRC_BURST_1 |
                    DMAC_CHAN_DEST_BURST_1 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_INT_TC_EN);

      dmalist[4].dma_src = (UNS_32)(dmasrc +
                    SMALL_BLOCK_PAGE_MAIN_AREA_SIZE);
      dmalist[4].dma_dest = dmadest;
      dmalist[4].next_lli = 0;
      dmalist[4].next_ctrl = (
                    (SMALL_BLOCK_PAGE_SPARE_AREA_SIZE / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_SRC_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);
    }
    else
    {
      dmalist[0].dma_src = (UNS_32)dmasrc;
      dmalist[0].dma_dest = dmadest;
      dmalist[0].next_lli = (UNS_32) & dmalist[1];
      dmalist[0].next_ctrl = (
                    ((SMALL_BLOCK_PAGE_MAIN_AREA_SIZE / 2) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_SRC_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

      dmalist[1].dma_src = (UNS_32)(dmasrc +
                    (SMALL_BLOCK_PAGE_MAIN_AREA_SIZE / 2));
      dmalist[1].dma_dest = dmadest;
      dmalist[1].next_lli = (UNS_32) & dmalist[2];
      dmalist[1].next_ctrl = (
                    ((SMALL_BLOCK_PAGE_MAIN_AREA_SIZE / 2) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_SRC_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

      dmalist[2].dma_src = (UNS_32)(dmasrc +
                    SMALL_BLOCK_PAGE_MAIN_AREA_SIZE);
      dmalist[2].dma_dest = dmadest;
      dmalist[2].next_lli = 0;
      dmalist[2].next_ctrl = (
                    (SMALL_BLOCK_PAGE_SPARE_AREA_SIZE / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_SRC_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);
    }
  }
  else if (slcdat.paramptr->block_page == BLOCK_PAGE_LARGE)
  {
    if (ecc != 0)
    {
      for (idx = 0; idx < 4; idx++)
      {
        dmalist[idx*4].dma_src = (UNS_32)(dmasrc +
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) * (idx * 2)));
        dmalist[idx*4].dma_dest = dmadest;
        dmalist[idx*4].next_lli = (UNS_32) & dmalist[(idx*4)+1];
        dmalist[idx*4].next_ctrl = (
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_SRC_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

        dmalist[(idx*4)+1].dma_src = (UNS_32)(dmasrc +
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) *
                    ((idx * 2) + 1)));
        dmalist[(idx*4)+1].dma_dest = dmadest;
        dmalist[(idx*4)+1].next_lli =
                    (UNS_32) & dmalist[(idx*4)+2];
        dmalist[(idx*4)+1].next_ctrl = (
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_SRC_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

        dmalist[(idx*4)+2].dma_src = (UNS_32)
                    & slcdat.regptr->slc_ecc;
        dmalist[(idx*4)+2].dma_dest = (UNS_32)(dmasrc +
                    LARGE_BLOCK_PAGE_1ST_ECC(idx));
        dmalist[(idx*4)+2].next_lli =
                    (UNS_32) & dmalist[(idx*4)+3];
        dmalist[(idx*4)+2].next_ctrl = (0x1 |
                    DMAC_CHAN_SRC_BURST_1 |
                    DMAC_CHAN_DEST_BURST_1 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_INT_TC_EN);

        dmalist[(idx*4)+3].dma_src = (UNS_32)
                    & slcdat.regptr->slc_ecc;
        dmalist[(idx*4)+3].dma_dest = (UNS_32)(dmasrc +
                    LARGE_BLOCK_PAGE_2ND_ECC(idx));
        dmalist[(idx*4)+3].next_lli =
                    (UNS_32) & dmalist[(idx*4)+4];
        dmalist[(idx*4)+3].next_ctrl = (0x1 |
                    DMAC_CHAN_SRC_BURST_1 |
                    DMAC_CHAN_DEST_BURST_1 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_INT_TC_EN);
      }
      dmalist[idx*4].dma_src = (UNS_32)(dmasrc +
                    LARGE_BLOCK_PAGE_MAIN_AREA_SIZE);
      dmalist[idx*4].dma_dest = dmadest;
      dmalist[idx*4].next_lli = 0;
      dmalist[idx*4].next_ctrl = (
                    (LARGE_BLOCK_PAGE_SPARE_AREA_SIZE / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_SRC_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);
    }
    else
    {
      for (idx = 0; idx < 4; idx++)
      {
        dmalist[idx*2].dma_src = (UNS_32)(dmasrc +
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) * (idx * 2)));
        dmalist[idx*2].dma_dest = dmadest;
        dmalist[idx*2].next_lli = (UNS_32) & dmalist[(idx*2)+1];
        dmalist[idx*2].next_ctrl = (
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_SRC_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);

        dmalist[(idx*2)+1].dma_src = (UNS_32)(dmasrc +
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) *
                    ((idx * 2) + 1)));
        dmalist[(idx*2)+1].dma_dest = dmadest;
        dmalist[(idx*2)+1].next_lli =
                    (UNS_32) & dmalist[(idx*2)+2];
        dmalist[(idx*2)+1].next_ctrl = (
                    ((LARGE_BLOCK_PAGE_MAIN_AREA_SIZE / 8) / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_SRC_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);
      }
      dmalist[idx*2].dma_src = (UNS_32)(dmasrc +
                    LARGE_BLOCK_PAGE_MAIN_AREA_SIZE);
      dmalist[idx*2].dma_dest = dmadest;
      dmalist[idx*2].next_lli = 0;
      dmalist[idx*2].next_ctrl = (
                    (LARGE_BLOCK_PAGE_SPARE_AREA_SIZE / 4) |
                    DMAC_CHAN_SRC_BURST_4 |
                    DMAC_CHAN_DEST_BURST_4 |
                    DMAC_CHAN_SRC_WIDTH_32 |
                    DMAC_CHAN_DEST_WIDTH_32 |
                    DMAC_CHAN_DEST_AHB1 |
                    DMAC_CHAN_SRC_AUTOINC |
                    DMAC_CHAN_INT_TC_EN);
    }
  }

