sobczyk/bsp/csps/lpc32xx/source/lpc32xx_slcnand_driver.c
  /* Get a DMA channel */
  dmach = dma_alloc_channel(-1, (PFV) slcnand_dma_interrupt);
  if (dmach < 0)
  {
    return _ERROR;
  }

  /* setup DMA channel */
  pdmaregs = dma_get_base();
  pdmaregs->int_tc_clear = _BIT(dmach);
  pdmaregs->int_err_clear = _BIT(dmach);
  pdmaregs->dma_chan[dmach].src_addr = dmalist[0].dma_src;
  pdmaregs->dma_chan[dmach].dest_addr = dmalist[0].dma_dest;
  pdmaregs->dma_chan[dmach].lli = (UNS_32)dmalist[0].next_lli;
  pdmaregs->dma_chan[dmach].control = dmalist[0].next_ctrl;
  pdmaregs->dma_chan[dmach].config_ch = DMAC_CHAN_ITC |
                    DMAC_CHAN_IE |
                    DMAC_CHAN_FLOW_D_M2P |
                    DMAC_DEST_PERIP(DMA_PERID_NAND1) |
                    DMAC_SRC_PERIP(0) |
                    DMAC_CHAN_ENABLE;

  return status;
}

/***********************************************************************
 *
 * Function: slcnand_read_id
 *
 * Purpose: Read SLC NAND flash id
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR as slc was not
 *     previously opened. Otherwise, read SLC NAND flash id.
 *
 * Parameters:
 *     devid: Pointer to SLC NAND controller config structure
 *     buf:   Pointer to data buffer to copy to
 *
 * Outputs: None
 *
 * Returns: The status of read id operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS slcnand_read_id(INT_32 devid, void *buf)
{
  STATUS status = _ERROR;
  UNS_8 *bptr = buf;
  int idx;

  if (slcdat.init == TRUE)
  {
    status = _NO_ERROR;

    /* ID read (1) command */
    slcdat.regptr->slc_cmd = NAND_CMD_READID;

    /* Column Address */
    slcdat.regptr->slc_addr = 0;

    /* Wait for SLC NAND ready */
    while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

    /* Read ID_SIZE bytes from SLC NAND flash data register */
    for (idx = 0; idx < ID_SIZE; idx++)
    {
      *bptr++ = (UNS_8)(slcdat.regptr->slc_data & _BITMASK(8));
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: slcnand_erase_block
 *
 * Purpose: Erase SLC NAND flash block
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR as slc was not
 *     previously opened. Otherwise, erase SLC NAND flash block.
 *
 * Parameters:
 *     devid: Pointer to SLC NAND controller config structure
 *     block_num: Block to be erased
 *
 * Outputs: None
 *
 * Returns: The status of block erase operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS slcnand_erase_block(INT_32 devid, UNS_32 block_num)
{
  STATUS status = _ERROR;

  if (slcdat.init == TRUE)
  {
    status = _NO_ERROR;

    if (slcdat.paramptr->block_page == BLOCK_PAGE_SMALL)
    {
      /* Wait for SLC NAND ready */
      while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

      /* Auto block erase 1-st command */
      slcdat.regptr->slc_cmd = NAND_CMD_ERASE1ST;

      /* Page Address 1st */
      slcdat.regptr->slc_addr = ((block_num << 5) & 0xE0);

      /* Page Address 2nd */
      slcdat.regptr->slc_addr = ((block_num << 5) >> 8) &
                    _BITMASK(8);

      if (slcdat.paramptr->addr_cycles == ADDR_CYCLES_4)
      {
        /* Page Address 3rd */
        slcdat.regptr->slc_addr = ((block_num << 5) >> 16) &
                    _BITMASK(8);
      }

      /* Auto block erase 2-nd command */
      slcdat.regptr->slc_cmd = NAND_CMD_ERASE2ND;

      /* Wait for SLC NAND ready */
      while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

      /* Status read (1) command */
      slcdat.regptr->slc_cmd = NAND_CMD_STATUS;

      /* Operation status */
      if (slcdat.regptr->slc_data & NAND_FLASH_FAILED)
      {
        status = _ERROR;
      }
    }
    else if (slcdat.paramptr->block_page == BLOCK_PAGE_LARGE)
    {
      /* Wait for SLC NAND ready */
      while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

      /* Auto block erase 1-st command */
      slcdat.regptr->slc_cmd = NAND_CMD_ERASE1ST;

      /* Page Address 1st */
      slcdat.regptr->slc_addr = ((block_num << 6) & 0xC0);

      /* Page Address 2nd */
      slcdat.regptr->slc_addr = ((block_num << 6) >> 8) &
                    _BITMASK(8);

      if (slcdat.paramptr->addr_cycles == ADDR_CYCLES_5)
      {
        /* Page Address 3rd */
        slcdat.regptr->slc_addr = ((block_num << 6) >> 16) &
                    _BITMASK(8);
      }

      /* Auto block erase 2-nd command */
      slcdat.regptr->slc_cmd = NAND_CMD_ERASE2ND;

      /* Wait for SLC NAND ready */
      while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

      /* Status read (1) command */
      slcdat.regptr->slc_cmd = NAND_CMD_STATUS;

      /* Operation status */
      if (slcdat.regptr->slc_data & NAND_FLASH_FAILED)
      {
        status = _ERROR;
      }
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: slcnand_read_spare
 *
 * Purpose: Read SLC NAND flash page spare area
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR as slc was not
 *     previously opened. Otherwise, read SLC NAND flash page spare
 *     area.
 *
 * Parameters:
 *     devid: Pointer to SLC NAND controller config structure
 *     blockpage: Pointer to SLC_BLOCKPAGE_T structure
 *
 * Outputs: None
 *
 * Returns: The status of read spare operation
 *
 * Notes:
 *     Small page -
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *     Large page -
 *      ------------------------------------------
 *     |   2048 bytes main   |   64 bytes spare   |
 *      ------------------------------------------
 *
 **********************************************************************/
STATUS slcnand_read_spare(INT_32 devid, SLC_BLOCKPAGE_T *blockpage)
{
  STATUS status = _ERROR;
  UNS_8 *bptr = blockpage->buffer;
  int idx;

  if (slcdat.init == TRUE)
  {
    status = _NO_ERROR;

    if (slcdat.paramptr->block_page == BLOCK_PAGE_SMALL)
    {
      /* Wait for SLC NAND ready */
      while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

      /* Read mode (3) command */
      slcdat.regptr->slc_cmd = NAND_CMD_READ3;

