sobczyk/bsp/csps/lpc32xx/source/lpc32xx_slcnand_driver.c
        /* Column Address */
        slcdat.regptr->slc_addr = 0;

        /* Page Address 1st */
        slcdat.regptr->slc_addr = (
                    ((blockpage->block_num << 5) &
                    0xE0) | (blockpage->page_num & 0x1F));

        /* Page Address 2nd */
        slcdat.regptr->slc_addr = (
                    ((blockpage->block_num << 5) >>
                    8) & _BITMASK(8));

        if (slcdat.paramptr->addr_cycles == ADDR_CYCLES_4)
        {
          /* Page Address 3rd */
          slcdat.regptr->slc_addr = (
                    ((blockpage->block_num << 5)
                    >> 16) & _BITMASK(8));
        }

        /* Read SMALL_BLOCK_PAGE_SIZE bytes from
        			SLC NAND flash data register */
        for (idx = 0; idx < SMALL_BLOCK_PAGE_SIZE; idx++)
        {
          *bptr++ = (UNS_8)(slcdat.regptr->slc_data &
                    _BITMASK(8));
        }
      }
    }
    else if (slcdat.paramptr->block_page == BLOCK_PAGE_LARGE)
    {
      if (blockpage->dma != 0)
      {
        /* Enable TC interrupt */
        slcdat.regptr->slc_ien |= SLCSTAT_INT_TC;

        if (blockpage->ecc != 0)
        {
          /* Enable DMA ECC channel, ECC, burst,
          		DMA read from slc */
          slcdat.regptr->slc_cfg |= (SLCCFG_DMA_DIR |
                    SLCCFG_DMA_BURST | SLCCFG_ECC_EN |
                    SLCCFG_DMA_ECC);
        }
        else
        {
          /* Enable burst, DMA read from slc */
          slcdat.regptr->slc_cfg |= (SLCCFG_DMA_DIR |
                    SLCCFG_DMA_BURST);
        }

        slcnand_dma_read(devid,
                    (UNS_32)&slcdat.regptr->slc_dma_data,
                    (UNS_32)dwptr, blockpage->dma,
                    blockpage->ecc);

        /* Wait for SLC NAND ready */
        while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

        /* Read mode (1) command */
        slcdat.regptr->slc_cmd = NAND_CMD_READ1;

        /* Column Address 1st */
        slcdat.regptr->slc_addr = 0;

        /* Column Address 2nd */
        slcdat.regptr->slc_addr = 0;

        /* Page Address 1st */
        slcdat.regptr->slc_addr = (((blockpage->block_num << 6)
                    & 0xC0) | (blockpage->page_num & 0x3F));

        /* Page Address 2nd */
        slcdat.regptr->slc_addr = (((blockpage->block_num << 6)
                    >> 8) & _BITMASK(8));

        if (slcdat.paramptr->addr_cycles == ADDR_CYCLES_5)
        {
          /* Page Address 3rd */
          slcdat.regptr->slc_addr = (((blockpage->block_num <<
                    6) >> 16) & _BITMASK(8));
        }

        /* Read start command */
        slcdat.regptr->slc_cmd = NAND_CMD_READSTART;

        /* Set transfer count */
        slcdat.regptr->slc_tc = LARGE_BLOCK_PAGE_SIZE;

        /* Clear ECC, start DMA */
        slcdat.regptr->slc_ctrl |= (SLCCTRL_DMA_START |
                    SLCCTRL_ECC_CLEAR);

        /* Wait for completion of DMA */
        while (dma_completion == FALSE);

        /* Wait for SLC NAND ready */
        while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

        slcdat.regptr->slc_ctrl &= ~SLCCTRL_DMA_START;

        if (blockpage->ecc != 0)
        {
          /* Disable DMA ECC channel, ECC, burst,
          		DMA read from slc */
          slcdat.regptr->slc_cfg &= ~(SLCCFG_DMA_DIR |
                    SLCCFG_DMA_BURST | SLCCFG_ECC_EN |
                    SLCCFG_DMA_ECC);
        }
        else
        {
          /* Enable burst, DMA read from slc */
          slcdat.regptr->slc_cfg &= ~(SLCCFG_DMA_DIR |
                    SLCCFG_DMA_BURST);
        }

        /* release the DMA Channel */
        dma_free_channel(dmach);

        if (blockpage->ecc != 0)
        {
          dwptr = (UNS_32 *)(blockpage->buffer +
                    LARGE_BLOCK_PAGE_1ST_ECC(0));
          if ((*dwptr & _BITMASK(24)) !=
                    (ECC[0] & _BITMASK(24)))
          {
            return _ERROR;
          }

          dwptr = (UNS_32 *)(blockpage->buffer +
                    LARGE_BLOCK_PAGE_2ND_ECC(0));
          if ((*dwptr & _BITMASK(24)) !=
                    (ECC[1] & _BITMASK(24)))
          {
            return _ERROR;
          }

          dwptr = (UNS_32 *)(blockpage->buffer +
                    LARGE_BLOCK_PAGE_1ST_ECC(1));
          if ((*dwptr & _BITMASK(24)) !=
                    (ECC[2] & _BITMASK(24)))
          {
            return _ERROR;
          }

          dwptr = (UNS_32 *)(blockpage->buffer +
                    LARGE_BLOCK_PAGE_2ND_ECC(1));
          if ((*dwptr & _BITMASK(24)) !=
                    (ECC[3] & _BITMASK(24)))
          {
            return _ERROR;
          }

          dwptr = (UNS_32 *)(blockpage->buffer +
                    LARGE_BLOCK_PAGE_1ST_ECC(2));
          if ((*dwptr & _BITMASK(24)) !=
                    (ECC[4] & _BITMASK(24)))
          {
            return _ERROR;
          }

          dwptr = (UNS_32 *)(blockpage->buffer +
                    LARGE_BLOCK_PAGE_2ND_ECC(2));
          if ((*dwptr & _BITMASK(24)) !=
                    (ECC[5] & _BITMASK(24)))
          {
            return _ERROR;
          }

          dwptr = (UNS_32 *)(blockpage->buffer +
                    LARGE_BLOCK_PAGE_1ST_ECC(3));
          if ((*dwptr & _BITMASK(24)) !=
                    (ECC[6] & _BITMASK(24)))
          {
            return _ERROR;
          }

          dwptr = (UNS_32 *)(blockpage->buffer +
                    LARGE_BLOCK_PAGE_2ND_ECC(3));
          if ((*dwptr & _BITMASK(24)) !=
                    (ECC[7] & _BITMASK(24)))
          {
            return _ERROR;
          }
        }
      }
      else
      {
        /* Wait for SLC NAND ready */
        while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

        /* Read mode (1) command */
        slcdat.regptr->slc_cmd = NAND_CMD_READ1;

        /* Column Address 1st */
        slcdat.regptr->slc_addr = 0;

        /* Column Address 2nd */
        slcdat.regptr->slc_addr = 0;

        /* Page Address 1st */
        slcdat.regptr->slc_addr = (((blockpage->block_num << 6)
                    & 0xC0) | (blockpage->page_num & 0x3F));

