sobczyk/bsp/csps/lpc32xx/source/lpc32xx_slcnand_driver.c
        /* Page Address 2nd */
        slcdat.regptr->slc_addr = (((blockpage->block_num << 6)
                    >> 8) & _BITMASK(8));

        if (slcdat.paramptr->addr_cycles == ADDR_CYCLES_5)
        {
          /* Page Address 3rd */
          slcdat.regptr->slc_addr = (((blockpage->block_num <<
                    6) >> 16) & _BITMASK(8));
        }

        /* Read start command */
        slcdat.regptr->slc_cmd = NAND_CMD_READSTART;

        /* Read LARGE_BLOCK_PAGE_SIZE bytes from
        			SLC NAND flash data register */
        for (idx = 0; idx < LARGE_BLOCK_PAGE_SIZE; idx++)
        {
          *bptr++ = (UNS_8)(slcdat.regptr->slc_data &
                    _BITMASK(8));
        }
      }
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: slcnand_write_page
 *
 * Purpose: Write SLC NAND flash page
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR as slc was not
 *     previously opened. Otherwise, write SLC NAND flash page.
 *
 * Parameters:
 *     devid: Pointer to SLC NAND controller config structure
 *     blockpage: Pointer to SLC_BLOCKPAGE_T structure
 *
 * Outputs: None
 *
 * Returns: The status of write page operation
 *
 * Notes:
 *     Write both SLC NAND flash page main area and spare area.
 *     Small page -
 *      ------------------------------------------
 *     |    512 bytes main   |   16 bytes spare   |
 *      ------------------------------------------
 *     Large page -
 *      ------------------------------------------
 *     |   2048 bytes main   |   64 bytes spare   |
 *      ------------------------------------------
 *     If DMA & ECC enabled, then the ECC generated for the 1st 256-byte
 *     data is written to the 3rd word of the spare area. The ECC
 *     generated for the 2nd 256-byte data is written to the 4th word
 *     of the spare area. The ECC generated for the 3rd 256-byte data is
 *     written to the 7th word of the spare area. The ECC generated
 *     for the 4th 256-byte data is written to the 8th word of the
 *     spare area and so on.
 *
 **********************************************************************/
STATUS slcnand_write_page(INT_32 devid, SLC_BLOCKPAGE_T *blockpage)
{
  STATUS status = _ERROR;
  UNS_8 *bptr = blockpage->buffer;
  UNS_32 *dwptr = (UNS_32 *)blockpage->buffer;
  int idx;

  if (slcdat.init == TRUE)
  {
    status = _NO_ERROR;

    if (slcdat.paramptr->block_page == BLOCK_PAGE_SMALL)
    {
      if (blockpage->dma != 0)
      {
        /* Enable TC interrupt */
        slcdat.regptr->slc_ien |= SLCSTAT_INT_TC;

        if (blockpage->ecc != 0)
        {
          /* Enable DMA ECC channel, ECC, burst */
          slcdat.regptr->slc_cfg |= (SLCCFG_DMA_BURST |
                    SLCCFG_ECC_EN | SLCCFG_DMA_ECC);
          /* DMA wtite to slc */
          slcdat.regptr->slc_cfg &= ~SLCCFG_DMA_DIR;
        }
        else
        {
          /* Enable burst */
          slcdat.regptr->slc_cfg |= SLCCFG_DMA_BURST;
          /* DMA wtite to slc */
          slcdat.regptr->slc_cfg &= ~SLCCFG_DMA_DIR;
        }

        slcnand_dma_write(devid, (UNS_32)dwptr,
                    (UNS_32)&slcdat.regptr->slc_dma_data,
                    blockpage->dma, blockpage->ecc);

        /* Wait for SLC NAND ready */
        while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

        /* Serial data input command */
        slcdat.regptr->slc_cmd = NAND_CMD_SDIN;

        /* Column Address */
        slcdat.regptr->slc_addr = 0;

        /* Page Address 1st */
        slcdat.regptr->slc_addr = (
                    ((blockpage->block_num << 5) &
                    0xE0) | (blockpage->page_num & 0x1F));

        /* Page Address 2nd */
        slcdat.regptr->slc_addr = (
                    ((blockpage->block_num << 5) >>
                    8) & _BITMASK(8));

        if (slcdat.paramptr->addr_cycles == ADDR_CYCLES_4)
        {
          /* Page Address 3rd */
          slcdat.regptr->slc_addr = (
                    ((blockpage->block_num << 5)
                    >> 16) & _BITMASK(8));
        }

        /* Set transfer count */
        slcdat.regptr->slc_tc = SMALL_BLOCK_PAGE_SIZE;

        /* Clear ECC, start DMA */
        slcdat.regptr->slc_ctrl |= (SLCCTRL_DMA_START |
                    SLCCTRL_ECC_CLEAR);

        /* Wait for completion of DMA */
        while (dma_completion == FALSE);

        /* Auto program command */
        slcdat.regptr->slc_cmd = NAND_CMD_PAGEPROG;

        /* Wait for SLC NAND ready */
        while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

        /* Status read (1) command */
        slcdat.regptr->slc_cmd = NAND_CMD_STATUS;

        /* Operation status */
        if (slcdat.regptr->slc_data & NAND_FLASH_FAILED)
        {
          status = _ERROR;
        }

        slcdat.regptr->slc_ctrl &= ~SLCCTRL_DMA_START;

        if (blockpage->ecc != 0)
        {
          /* Disable DMA ECC channel, ECC, burst */
          slcdat.regptr->slc_cfg &= ~(SLCCFG_DMA_BURST |
                    SLCCFG_ECC_EN | SLCCFG_DMA_ECC);
        }
        else
        {
          /* Enable burst */
          slcdat.regptr->slc_cfg &= ~SLCCFG_DMA_BURST;
        }

        /* release the DMA Channel */
        dma_free_channel(dmach);
      }
      else
      {
        /* Wait for SLC NAND ready */
        while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

        /* Serial data input command */
        slcdat.regptr->slc_cmd = NAND_CMD_SDIN;

        /* Column Address */
        slcdat.regptr->slc_addr = 0;

        /* Page Address 1st */
        slcdat.regptr->slc_addr = (
                    ((blockpage->block_num << 5) &
                    0xE0) | (blockpage->page_num & 0x1F));

        /* Page Address 2nd */
        slcdat.regptr->slc_addr = (
                    ((blockpage->block_num << 5) >>
                    8) & _BITMASK(8));

        if (slcdat.paramptr->addr_cycles == ADDR_CYCLES_4)
        {
          /* Page Address 3rd */
          slcdat.regptr->slc_addr = (
                    ((blockpage->block_num << 5)
                    >> 16) & _BITMASK(8));
        }

        /* Write SMALL_BLOCK_PAGE_SIZE bytes to
        			SLC NAND flash data register */
        for (idx = 0; idx < SMALL_BLOCK_PAGE_SIZE; idx++)
        {
          slcdat.regptr->slc_data = (UNS_32)(*bptr++);
        }

        /* Auto program command */
        slcdat.regptr->slc_cmd = NAND_CMD_PAGEPROG;

        /* Wait for SLC NAND ready */
        while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

