sobczyk/bsp/csps/lpc32xx/source/lpc32xx_slcnand_driver.c
        /* Status read (1) command */
        slcdat.regptr->slc_cmd = NAND_CMD_STATUS;

        /* Operation status */
        if (slcdat.regptr->slc_data & NAND_FLASH_FAILED)
        {
          status = _ERROR;
        }
      }
    }
    else if (slcdat.paramptr->block_page == BLOCK_PAGE_LARGE)
    {
      if (blockpage->dma != 0)
      {
        /* Enable TC interrupt */
        slcdat.regptr->slc_ien |= SLCSTAT_INT_TC;

        if (blockpage->ecc != 0)
        {
          /* Enable DMA ECC channel, ECC, burst */
          slcdat.regptr->slc_cfg |= (SLCCFG_DMA_BURST |
                    SLCCFG_ECC_EN | SLCCFG_DMA_ECC);
          /* DMA wtite to slc */
          slcdat.regptr->slc_cfg &= ~SLCCFG_DMA_DIR;
        }
        else
        {
          /* Enable burst */
          slcdat.regptr->slc_cfg |= SLCCFG_DMA_BURST;
          /* DMA wtite to slc */
          slcdat.regptr->slc_cfg &= ~SLCCFG_DMA_DIR;
        }

        slcnand_dma_write(devid, (UNS_32)dwptr,
                    (UNS_32)&slcdat.regptr->slc_dma_data,
                    blockpage->dma, blockpage->ecc);

        /* Wait for SLC NAND ready */
        while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

        /* Serial data input command */
        slcdat.regptr->slc_cmd = NAND_CMD_SDIN;

        /* Column Address 1st */
        slcdat.regptr->slc_addr = 0;

        /* Column Address 2nd */
        slcdat.regptr->slc_addr = 0;

        /* Page Address 1st */
        slcdat.regptr->slc_addr = (((blockpage->block_num << 6)
                    & 0xC0) | (blockpage->page_num & 0x3F));

        /* Page Address 2nd */
        slcdat.regptr->slc_addr = (((blockpage->block_num << 6)
                    >> 8) & _BITMASK(8));

        if (slcdat.paramptr->addr_cycles == ADDR_CYCLES_5)
        {
          /* Page Address 3rd */
          slcdat.regptr->slc_addr = (((blockpage->block_num <<
                    6) >> 16) & _BITMASK(8));
        }

        /* Set transfer count */
        slcdat.regptr->slc_tc = LARGE_BLOCK_PAGE_SIZE;

        /* Clear ECC, start DMA */
        slcdat.regptr->slc_ctrl |= (SLCCTRL_DMA_START |
                    SLCCTRL_ECC_CLEAR);

        /* Wait for completion of DMA */
        while (dma_completion == FALSE);

        /* Auto program command */
        slcdat.regptr->slc_cmd = NAND_CMD_PAGEPROG;

        /* Wait for SLC NAND ready */
        while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

        /* Status read (1) command */
        slcdat.regptr->slc_cmd = NAND_CMD_STATUS;

        /* Operation status */
        if (slcdat.regptr->slc_data & NAND_FLASH_FAILED)
        {
          status = _ERROR;
        }

        slcdat.regptr->slc_ctrl &= ~SLCCTRL_DMA_START;

        if (blockpage->ecc != 0)
        {
          /* Disable DMA ECC channel, ECC, burst */
          slcdat.regptr->slc_cfg &= ~(SLCCFG_DMA_BURST |
                    SLCCFG_ECC_EN | SLCCFG_DMA_ECC);
        }
        else
        {
          /* Enable burst */
          slcdat.regptr->slc_cfg &= ~SLCCFG_DMA_BURST;
        }

        /* release the DMA Channel */
        dma_free_channel(dmach);
      }
      else
      {
        /* Wait for SLC NAND ready */
        while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

        /* Serial data input command */
        slcdat.regptr->slc_cmd = NAND_CMD_SDIN;

        /* Column Address 1st */
        slcdat.regptr->slc_addr = 0;

        /* Column Address 2nd */
        slcdat.regptr->slc_addr = 0;

        /* Page Address 1st */
        slcdat.regptr->slc_addr = (((blockpage->block_num << 6)
                    & 0xC0) | (blockpage->page_num & 0x3F));

        /* Page Address 2nd */
        slcdat.regptr->slc_addr = (((blockpage->block_num << 6)
                    >> 8) & _BITMASK(8));

        if (slcdat.paramptr->addr_cycles == ADDR_CYCLES_5)
        {
          /* Page Address 3rd */
          slcdat.regptr->slc_addr = (((blockpage->block_num <<
                    6) >> 16) & _BITMASK(8));
        }

        /* Write LARGE_BLOCK_PAGE_SIZE bytes to
        			SLC NAND flash data register */
        for (idx = 0; idx < LARGE_BLOCK_PAGE_SIZE; idx++)
        {
          slcdat.regptr->slc_data = (UNS_32)(*bptr++);
        }

        /* Auto program command */
        slcdat.regptr->slc_cmd = NAND_CMD_PAGEPROG;

        /* Wait for SLC NAND ready */
        while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

        /* Status read (1) command */
        slcdat.regptr->slc_cmd = NAND_CMD_STATUS;

        /* Operation status */
        if (slcdat.regptr->slc_data & NAND_FLASH_FAILED)
        {
          status = _ERROR;
        }
      }
    }
  }

  return status;
}

/***********************************************************************
 * SLC NAND controller driver public functions
 **********************************************************************/

/***********************************************************************
 *
 * Function: slcnand_open
 *
 * Purpose: Open the SLC NAND controller
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     ipbase: Pointer to a SLC NAND controller peripheral block
 *     arg   : Not used
 *
 * Outputs: None
 *
 * Returns: The pointer to a SLC NAND controller config structure or
 *          NULL
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 slcnand_open(void *ipbase, INT_32 arg)
{
  INT_32 status = 0;

  if ((SLCNAND_REGS_T *) ipbase == SLCNAND)
  {
    /* Has SLC NAND driver been previously initialized? */
    if (slcdat.init == FALSE)
    {
      /* Device not initialized and it usable, so set it to
      used */
      slcdat.init = TRUE;

      /* Save address of register block */
      slcdat.regptr = SLCNAND;

      /* Save address of NAND flash parameters */
      slcdat.paramptr = (NANDFLASH_PARAM_T *) arg;

      if (slcdat.paramptr->bus_width == BUS_WIDTH_8)
      {
        /* Select SLC NAND controller
                    disable DMA_REQ signal on NAND_RnB,
                    disable DMA_REQ signal on NAND_INT */
        clkpwr_setup_nand_ctrlr(1, 0, 0);

        /* Enable SLC NAND clock */
        clkpwr_clk_en_dis(CLKPWR_NAND_SLC_CLK, 1);

        /* Reset SLC NAND controller & clear ECC */
        slcdat.regptr->slc_ctrl = (SLCCTRL_SW_RESET |
                                   SLCCTRL_ECC_CLEAR);

