sobczyk/bsp/csps/lpc32xx/source/lpc32xx_slcnand_driver.c
        /* 8-bit bus, no DMA, CE normal */
        slcdat.regptr->slc_cfg = 0;

        /* Interrupts disabled and cleared */
        slcdat.regptr->slc_ien = 0;
        slcdat.regptr->slc_icr = (SLCSTAT_INT_TC |
                                  SLCSTAT_INT_RDY_EN);

        /* Start with slowest timings possible */
        slcdat.regptr->slc_tac = (SLCTAC_WDR(15) |
                    SLCTAC_WWIDTH(15) |
                    SLCTAC_WHOLD(15) |
                    SLCTAC_WSETUP(15) |
                    SLCTAC_RDR(15) |
                    SLCTAC_RWIDTH(15) |
                    SLCTAC_RHOLD(15) |
                    SLCTAC_RSETUP(15));

        /* Reset SLC NAND Flash */
        slcdat.regptr->slc_cmd = NAND_CMD_RESET;

        /* Wait for SLC NAND ready */
        while (!(slcdat.regptr->slc_stat & SLCSTAT_NAND_READY));

        /* Install SLC NAND controller interrupt handler as a
        			IRQ interrupts */
        int_install_irq_handler(IRQ_FLASH,
                    (PFV) slcnand_interrupt);

        /* Enable SLC NAND interrupt in the interrupt
        			controller */
        int_enable(IRQ_FLASH);

        /* Return pointer to SLC NAND controller
        			config structure */
        status = (INT_32) & slcdat;
      }
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: slcnand_close
 *
 * Purpose: Close the SLC NAND controller
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR to the caller as the
 *     device was not previously opened. Otherwise, disable the timers,
 *     set init to FALSE, and return _NO_ERROR to the caller.
 *
 * Parameters:
 *     devid: Pointer to SLC NAND controller config structure
 *
 * Outputs: None
 *
 * Returns: The status of the close operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS slcnand_close(INT_32 devid)
{
  STATUS status = _ERROR;

  if ((SLCNAND_CFG_T *) devid == &slcdat)
  {
    if (slcdat.init == TRUE)
    {
      /* Set default SLC NAND functions to disabled */
      slcdat.regptr->slc_ctrl = 0;

      /* 8-bit bus, no DMA, CE normal */
      slcdat.regptr->slc_cfg = 0;

      /* Disable SLC NAND clock */
      clkpwr_clk_en_dis(CLKPWR_NAND_SLC_CLK, 0);

      /* Set device as uninitialized */
      slcdat.init = FALSE;

      /* Successful operation */
      status = _NO_ERROR;
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: slcnand_ioctl
 *
 * Purpose: SLC NAND controller configuration block
 *
 * Processing:
 *     This function is a large case block. Based on the passed function
 *     and option values, set or get the appropriate timer parameter.
 *
 * Parameters:
 *     devid: Pointer to SLC NAND controller config structure
 *     cmd:   ioctl command
 *     arg:   ioctl argument
 *
 * Outputs: None
 *
 * Returns: The status of the ioctl operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS slcnand_ioctl(INT_32 devid,
                     INT_32 cmd,
                     INT_32 arg)
{
  int idx;
  INT_32 status = _ERROR;

  if ((SLCNAND_CFG_T *) devid == &slcdat)
  {
    if (slcdat.init == TRUE)
    {
      status = _NO_ERROR;

      switch (cmd)
      {
        case SLC_RESET:
          /* Reset SLC NAND controller */
          slcdat.regptr->slc_ctrl |= SLCCTRL_SW_RESET;
          break;

        case SLC_ENABLE_ECC:
          /* Enable or disable ECC */
          if (arg == 1)
          {
            /* Enable */
            slcdat.regptr->slc_cfg |= SLCCFG_ECC_EN;
          }
          else
          {
            /* Disable */
            slcdat.regptr->slc_cfg &= ~SLCCFG_ECC_EN;
          }
          break;

        case SLC_CLEAR_ECC:
          /* Clear ECC */
          slcdat.regptr->slc_ctrl = SLCCTRL_ECC_CLEAR;
          break;

        case SLC_READ_ECC:
          /* Read ECC */
          status = slcdat.regptr->slc_ecc;
          break;

        case SLC_SET_TIMING:
          /* Set timing */
          slcdat.regptr->slc_tac = (
                    SLCTAC_WDR(
                    ((SLC_TAC_T *) arg)->w_rdy) |
                    SLCTAC_WWIDTH(
                    ((SLC_TAC_T *) arg)->w_width) |
                    SLCTAC_WHOLD(
                    ((SLC_TAC_T *) arg)->w_hold) |
                    SLCTAC_WSETUP(
                    ((SLC_TAC_T *) arg)->w_setup) |
                    SLCTAC_RDR(
                    ((SLC_TAC_T *) arg)->r_rdy) |
                    SLCTAC_RWIDTH(
                    ((SLC_TAC_T *) arg)->r_width) |
                    SLCTAC_RHOLD(
                    ((SLC_TAC_T *) arg)->r_hold) |
                    SLCTAC_RSETUP(
                    ((SLC_TAC_T *) arg)->r_setup));
          break;

        case SLC_ENAB_INTS:
          /* Enable interrupt */
          slcdat.regptr->slc_ien |= arg;
          break;

        case SLC_DISAB_INTS:
          /* Disable interrupt */
          slcdat.regptr->slc_ien &= ~arg;
          break;

        case SLC_SET_INTS:
          /* Set interrupt */
          slcdat.regptr->slc_isr = arg;
          break;

        case SLC_CLEAR_INTS:
          /* Clear interrupt */
          slcdat.regptr->slc_icr = arg;
          break;

        case SLC_SEND_CMD:
          /* Issue command to SLC NAND Flash */
          for (idx = 0; idx <
                    ((SLC_CMDADR_T *) arg)->num_items; idx++)
          {
            slcdat.regptr->slc_cmd =
                    ((SLC_CMDADR_T *) arg)->items[idx];
          }
          break;

        case SLC_SEND_ADDR:
          /* Issue address to SLC NAND Flash */
          for (idx = 0; idx <
                    ((SLC_CMDADR_T *) arg)->num_items; idx++)
          {
            slcdat.regptr->slc_addr =
                    ((SLC_CMDADR_T *) arg)->items[idx];
          }
          break;

        case SLC_STOP:
          /* Stop current SLC NAND controller sequence */
          slcdat.regptr->slc_stop = arg;
          break;

        case SLC_GET_STATUS:
          /* Get SLC NAND controller status */
          switch (arg)
          {
            case DMA_FIFO_ST:
              /* Return SLC DMA FIFO status */
              if ((slcdat.regptr->slc_stat &
                    SLCSTAT_DMA_FIFO) != 0)
              {
                status = 1;
              }
              else
              {
                status = 0;
              }
              break;

            case SLC_FIFO_ST:
              /* Return SLC data FIFO status */
              if ((slcdat.regptr->slc_stat &
                    SLCSTAT_SLC_FIFO) != 0)
              {
                status = 1;
              }
              else
              {
                status = 0;
              }
              break;

            case SLC_READY_ST:
              /* Return SLC NAND ready signal */
              if ((slcdat.regptr->slc_stat &
                    SLCSTAT_NAND_READY) != 0)
              {
                status = 1;
              }
              else
              {
                status = 0;
              }
              break;

            case SLC_INT_ST:
              /* Return SLC NAND interrupt states */
              status = slcdat.regptr->slc_int_stat;
              break;

            default:
              /* Unsupported parameter */
              status = LPC_BAD_PARAMS;
          }
          break;

