sobczyk/bsp/csps/lpc32xx/source/lpc32xx_slcnand_driver.c
        case SLC_READ_ID:
          /* Read SLC NAND Flash id */
          status = slcnand_read_id(devid, (void *) arg);
          break;

        case SLC_ERASE_BLOCK:
          /* Erase SLC NAND Flash block */
          status = slcnand_erase_block(devid, (UNS_32) arg);
          break;

        case SLC_READ_SPARE:
          /* Read SLC NAND flash spare */
          status = slcnand_read_spare(devid,
                    (SLC_BLOCKPAGE_T *) arg);
          break;

        case SLC_READ_PAGE:
          /* Read SLC NAND flash page */
          status = slcnand_read_page(devid,
                    (SLC_BLOCKPAGE_T *) arg);
          break;

        case SLC_WRITE_PAGE:
          /* Write SLC NAND flash page */
          status = slcnand_write_page(devid,
                    (SLC_BLOCKPAGE_T *) arg);
          break;

        default:
          /* Unsupported parameter */
          status = LPC_BAD_PARAMS;
      }
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: slcnand_read
 *
 * Purpose: SLC NAND controller read function (stub only)
 *
 * Processing:
 *     Return 0 to the caller.
 *
 * Parameters:
 *     devid:     Pointer to SLC NAND controller descriptor
 *     buffer:    Pointer to data buffer to copy to
 *     max_bytes: Number of bytes to read
 *
 * Outputs: None
 *
 * Returns: Number of bytes actually read (always 0)
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 slcnand_read(INT_32 devid,
                    void *buffer,
                    INT_32 max_bytes)
{
  return 0;
}

/***********************************************************************
 *
 * Function: slcnand_write
 *
 * Purpose: SLC NAND controller write function (stub only)
 *
 * Processing:
 *     Return 0 to the caller.
 *
 * Parameters:
 *     devid:   Pointer to SLC NAND controller descriptor
 *     buffer:  Pointer to data buffer to copy from
 *     n_bytes: Number of bytes to write
 *
 * Outputs: None
 *
 * Returns: Number of bytes actually written (always 0)
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 slcnand_write(INT_32 devid,
                     void *buffer,
                     INT_32 n_bytes)
{
  return 0;
}
